// ===========================================================
// Version:        3.0.2
// ===========================================================
/* ***********************************************************
@Copyright Alexander V. Bakhshiev, 2002.
E-mail:		alexab@ailab.ru
url:            http://ailab.ru

This file - part of the project: Neuro Modeler Software Developer Kit (NMSDK)

File License:        BSD License
Project License:     BSD License
See file license.txt for more information
*********************************************************** */
#ifndef UNET_CPP
#define UNET_CPP

#include "UNet.h"

namespace RDK {

// Методы
// --------------------------
// Конструкторы и деструкторы
// --------------------------
UNet::UNet(void)
{
}

UNet::~UNet(void)
{
}
// --------------------------

// --------------------------
// Системные методы управления объектом
// --------------------------
// Выделяет память для новой чистой копии объекта этого класса
UNet* UNet::New(void)
{
 return new UNet;
}
// --------------------------

// --------------------------
// Методы управления структурой сети
// --------------------------
// --------------------------



// --------------------------
// Методы управления счетом
// --------------------------
// Восстановление настроек по умолчанию и сброс процесса счета
bool UNet::Default(void)
{
 if(!UANet::Default())
  return false;

 return true;
}

// Обеспечивает сборку внутренней структуры объекта
// после настройки параметров
// Автоматически вызывает метод Reset() и выставляет Ready в true
// в случае успешной сборки
bool UNet::Build(void)
{
 return UANet::Build();
}

// Сброс процесса счета без потери настроек
bool UNet::Reset(void)
{
 return UANet::Reset();
}
// --------------------------


// --------------------------
// Скрытые методы управления счетом
// --------------------------
// --------------------------

}
#endif

